#include <iostream>
using namespace std;
int main() {
	// 1
	//for (int i = 1; i <= 5; i = i + 1) {
	//	cout << i << " ";
    //}
	//system("pause");
	
    // 2
	//for (int i = 5; i >= 1; i = i - 1) {
	//	cout << i << " ";
	//}
	//system("pause");

	// 3
	//for (int i = 1; i <= 10; i = i + 1) {
	//	cout << " 3 *  " << i << " = " << 3 * i << endl;
	//}
	//system("pause");


	// 4 до 20
	//int s = 0;
	//for (int i = 1; i <= 20; i = i + 1) {
	//	s = s + i;
	//} 
	//cout << s << endl;
	//system("pause");

	// 1 
	//Составьте программу, выводящую на экран квадраты чисел от 10 до 20.
	//for (int i = 10; i <= 20; i = i + 1) {
	//	cout << i * i << endl;
	//}
	//system("pause");

	// 2
	//Составьте программу, котораЯ вычисляет сумму чисел от 1 до n.значение n вводится с клавиатуры.
	//int a;
	//cin >> a;
	//int s = 0;
	//for (int i = 1; i <= a; i = i + 1) {
	//	s = s + i;
	//}
	//cout << s << endl;
	//system("pause");

	//3
	//Составьте программу, составьте программу, которая вычисляет произведение чисел от 1 до n.n вводится с клавиатуры.
	//int a;
	//cin >> a;
	//int p = 1;
	//for (int i = 1; i <= a; i = i + 1) {
	//	p = p * i;
	//}
	//cout << p << endl;
	//system("pause");

	//4
	//С клавиатуры вводятся n чисел. Составьте программу, которая определяет кол-во отрицательных, 
	//кол-во положительных и кол-во нулей среди введеных чисел.Значение n вводится с клавиатуры.
	//int n,x;
	//cin >> n;
	//int k = 0;
	//for(int i = 1; i <= n; i = i + 1)
	//{
	//	cin >> x;
	//	if (x > 0) { k++; }
	//}
	//cout << k << endl;
	//system("pause");

    // 5
	//Составьте программы перевода старинных русских мер длины, торгового и аптекарского веса(счетчик цикла от 1 до 10)
	//* саженей в метры(1 сажень равна 2, 1366 м)
	//for (double i = 1; i <= 10; i = i + 1) {
	//	cout << i * 2.1366 <<" ";
	//}
	//system("pause");
}